In [72]:
import seaborn as sns
import pandas as pd
from sklearn.model_selection import train_test_split

df = sns.load_dataset('titanic')
X_train, X_test, y_train, y_test = train_test_split(df, df['survived'], test_size=0.2, random_state=42, stratify=df['survived'])
X_train = X_train.drop(['alive', 'survived'], axis=1)
X_test = X_test.drop(['alive', 'survived'], axis=1)

In [68]:
X_train
# X_train['age'].value_counts()

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alone
692,3,male,NaN,0,0,56.4958,S,Third,man,True,NaN,Southampton,True
481,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,True
527,1,male,NaN,0,0,221.7792,S,First,man,True,C,Southampton,True
855,3,female,18.0,0,1,9.3500,S,Third,woman,False,NaN,Southampton,False
801,2,female,31.0,1,1,26.2500,S,Second,woman,False,NaN,Southampton,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
359,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,True
258,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,True
736,3,female,48.0,1,3,34.3750,S,Third,woman,False,NaN,Southampton,False
462,1,male,47.0,0,0,38.5000,S,First,man,True,E,Southampton,True
507,1,male,NaN,0,0,26.5500,S,First,man,True,NaN,Southampton,True

In [73]:
print('결측치\n', X_train.isna().sum())
print('deck\n', X_train['deck'].value_counts())
print('embarked\n', X_train['embarked'].value_counts())
print('embark_town', X_train['embark_town'].value_counts())

결측치
 pclass           0
sex              0
age            137
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           553
embark_town      2
alone            0
dtype: int64
deck
 C    41
B    34
E    29
D    26
A    14
F    11
G     4
Name: deck, dtype: int64
embarked
 S    516
C    139
Q     55
Name: embarked, dtype: int64
embark_town Southampton    516
Cherbourg      139
Queenstown      55
Name: embark_town, dtype: int64

In [74]:
#사용자 코드
#1. 결측치 입력

missing = ['age']
for i in missing:
    X_train[i] = X_train[i].fillna(X_train[i].mean())
    X_testpi = X_test[i].fillna(X_test[i].mean())
    
X_train['deck'] =  X_train['deck'].fillna('C')
X_test['deck'] =  X_test['deck'].fillna('C')

X_train['embarked'] = X_train['embarked'].fillna('S')
X_test['embarked'] = X_test['embarked'].fillna('S')

X_train['embark_town'] = X_train['embark_town'].fillna('S')
X_test['embark_town'] = X_test['embark_town'].fillna('S')

# print(X_train.isna().sum())

#2. 라벨인코딩
from sklearn.preprocessing import LabelEncoder
label =  ['sex', 'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town', 'alone']
X_train[label] = X_train[label].apply(LabelEncoder().fit_transform)
X_test[label] = X_test[label].apply(LabelEncoder().fit_transform)

print(X_train.head())

     pclass  sex        age  sibsp  parch      fare  embarked  class  who  \
692       3    1  29.807687      0      0   56.4958         2      2    1
481       2    1  29.807687      0      0    0.0000         2      1    1
527       1    1  29.807687      0      0  221.7792         2      0    1
855       3    0  18.000000      0      1    9.3500         2      2    2
801       2    0  31.000000      1      1   26.2500         2      1    2

     adult_male  deck  embark_town  alone
692           1     2            3      1
481           1     2            3      1
527           1     2            3      1
855           0     2            3      0
801           0     2            3      0

In [113]:
# 확인용
# #2. 라벨인코딩
# from sklearn.preprocessing import LabelEncoder
# label = ['sex', 'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town', 'alon']
# for i in label:
#     print(i)

# X_train[label] = X_train[label].apply(LabelEncoder().fit_transform)
# X_test[label] = X_test[label].apply(LabelEncoder().fit_transform)
# X_train.head()

df = sns.load_dataset('titanic')
X_train, X_test, y_train, y_test = train_test_split(df, df['survived'], test_size=0.2, random_state=42, stratify=df['survived'])
X_train = X_train.drop(['alive', 'survived'], axis=1)
X_test = X_test.drop(['alive', 'survived'], axis=1)
missing = ['age']
for i in missing:
    X_train[i] = X_train[i].fillna(X_train[i].mean())
    X_testpi = X_test[i].fillna(X_test[i].mean())
    
X_train['deck'] =  X_train['deck'].fillna('C')
X_test['deck'] =  X_test['deck'].fillna('C')

X_train['embarked'] = X_train['embarked'].fillna('S')
X_test['embarked'] = X_test['embarked'].fillna('S')

X_train['embark_town'] = X_train['embark_town'].fillna('S')
X_test['embark_town'] = X_test['embark_town'].fillna('S')
X_train1 = X_train
X_test1 = X_test
X_train1
X_test1

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alone
565,3,male,24.0,2,0,24.1500,S,Third,man,True,C,Southampton,False
160,3,male,44.0,0,1,16.1000,S,Third,man,True,C,Southampton,False
553,3,male,22.0,0,0,7.2250,C,Third,man,True,C,Cherbourg,True
860,3,male,41.0,2,0,14.1083,S,Third,man,True,C,Southampton,False
241,3,female,NaN,1,0,15.5000,Q,Third,woman,False,C,Queenstown,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,2,female,25.0,0,1,26.0000,S,Second,woman,False,C,Southampton,False
91,3,male,20.0,0,0,7.8542,S,Third,man,True,C,Southampton,True
883,2,male,28.0,0,0,10.5000,S,Second,man,True,C,Southampton,True
473,2,female,23.0,0,0,13.7917,C,Second,woman,False,D,Cherbourg,True
637,2,male,31.0,1,1,26.2500,S,Second,man,True,C,Southampton,False

In [105]:
# 확인용
X_train[label] = X_train[label].apply(LabelEncoder().fit_transform)
X_test[label] = X_test[label].apply(LabelEncoder().fit_transform)
X_train
X_test

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alone
565,3,1,24.0,2,0,24.1500,2,2,1,1,2,2,0
160,3,1,44.0,0,1,16.1000,2,2,1,1,2,2,0
553,3,1,22.0,0,0,7.2250,0,2,1,1,2,0,1
860,3,1,41.0,2,0,14.1083,2,2,1,1,2,2,0
241,3,0,NaN,1,0,15.5000,1,2,2,0,2,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,2,0,25.0,0,1,26.0000,2,1,2,0,2,2,0
91,3,1,20.0,0,0,7.8542,2,2,1,1,2,2,1
883,2,1,28.0,0,0,10.5000,2,1,1,1,2,2,1
473,2,0,23.0,0,0,13.7917,0,1,2,0,3,0,1
637,2,1,31.0,1,1,26.2500,2,1,1,1,2,2,0

In [106]:
print(X_train.dtypes)

pclass           int64
sex              int64
age            float64
sibsp            int64
parch            int64
fare           float64
embarked         int64
class            int64
who              int64
adult_male       int64
deck             int64
embark_town      int64
alone            int64
dtype: object

In [114]:
# 확인용
# print(X_train)
dtype = ['pclass', 'sex', 'class']

for i in X_train[dtype]:
    X_train[i] = X_train[i].astype('category')
for i in X_test[dtype]:
    X_test[i] = X_test[i].astype('category')
    
print(X_train.dtypes)
X_train

pclass         category
sex            category
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alone              bool
dtype: object

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alone
692,3,male,29.807687,0,0,56.4958,S,Third,man,True,C,Southampton,True
481,2,male,29.807687,0,0,0.0000,S,Second,man,True,C,Southampton,True
527,1,male,29.807687,0,0,221.7792,S,First,man,True,C,Southampton,True
855,3,female,18.000000,0,1,9.3500,S,Third,woman,False,C,Southampton,False
801,2,female,31.000000,1,1,26.2500,S,Second,woman,False,C,Southampton,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
359,3,female,29.807687,0,0,7.8792,Q,Third,woman,False,C,Queenstown,True
258,1,female,35.000000,0,0,512.3292,C,First,woman,False,C,Cherbourg,True
736,3,female,48.000000,1,3,34.3750,S,Third,woman,False,C,Southampton,False
462,1,male,47.000000,0,0,38.5000,S,First,man,True,E,Southampton,True
507,1,male,29.807687,0,0,26.5500,S,First,man,True,C,Southampton,True

In [115]:
# 확인용
X_train = pd.get_dummies(X_train)
X_test = pd.get_dummies(X_test)
X_train

,age,sibsp,parch,fare,adult_male,alone,pclass_1,pclass_2,pclass_3,sex_female,...,deck_B,deck_C,deck_D,deck_E,deck_F,deck_G,embark_town_Cherbourg,embark_town_Queenstown,embark_town_S,embark_town_Southampton
692,29.807687,0,0,56.4958,True,True,0,0,1,0,...,0,1,0,0,0,0,0,0,0,1
481,29.807687,0,0,0.0000,True,True,0,1,0,0,...,0,1,0,0,0,0,0,0,0,1
527,29.807687,0,0,221.7792,True,True,1,0,0,0,...,0,1,0,0,0,0,0,0,0,1
855,18.000000,0,1,9.3500,False,False,0,0,1,1,...,0,1,0,0,0,0,0,0,0,1
801,31.000000,1,1,26.2500,False,False,0,1,0,1,...,0,1,0,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
359,29.807687,0,0,7.8792,False,True,0,0,1,1,...,0,1,0,0,0,0,0,1,0,0
258,35.000000,0,0,512.3292,False,True,1,0,0,1,...,0,1,0,0,0,0,1,0,0,0
736,48.000000,1,3,34.3750,False,False,0,0,1,1,...,0,1,0,0,0,0,0,0,0,1
462,47.000000,0,0,38.5000,True,True,1,0,0,0,...,0,0,0,1,0,0,0,0,0,1
507,29.807687,0,0,26.5500,True,True,1,0,0,0,...,0,1,0,0,0,0,0,0,0,1

In [ ]:
#.3 데이터 타입변환, 더미
print(X_train.dtypes)
dtype = ['pclass', 'sex', 'class']
for i in X_train[dtype]:
    X_train[i] = X_train[i].astype('category')
for i in X_test[dtype]:
    X_test[i] = X_test[i].astype('category')

X_train = pd.get_dummies(X_train)
X_test = pd.get_dummies(X_test)

print(X_train.head())

In [116]:
X_train2 = X_train
X_train1 = X_train
X_train1['age_qcut'] = pd.qcut(X_train['age'], 5, labels=False)
X_train1
# X_train

,age,sibsp,parch,fare,adult_male,alone,pclass_1,pclass_2,pclass_3,sex_female,...,deck_C,deck_D,deck_E,deck_F,deck_G,embark_town_Cherbourg,embark_town_Queenstown,embark_town_S,embark_town_Southampton,age_qcut
692,29.807687,0,0,56.4958,True,True,0,0,1,0,...,1,0,0,0,0,0,0,0,1,2
481,29.807687,0,0,0.0000,True,True,0,1,0,0,...,1,0,0,0,0,0,0,0,1,2
527,29.807687,0,0,221.7792,True,True,1,0,0,0,...,1,0,0,0,0,0,0,0,1,2
855,18.000000,0,1,9.3500,False,False,0,0,1,1,...,1,0,0,0,0,0,0,0,1,0
801,31.000000,1,1,26.2500,False,False,0,1,0,1,...,1,0,0,0,0,0,0,0,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
359,29.807687,0,0,7.8792,False,True,0,0,1,1,...,1,0,0,0,0,0,1,0,0,2
258,35.000000,0,0,512.3292,False,True,1,0,0,1,...,1,0,0,0,0,1,0,0,0,3
736,48.000000,1,3,34.3750,False,False,0,0,1,1,...,1,0,0,0,0,0,0,0,1,4
462,47.000000,0,0,38.5000,True,True,1,0,0,0,...,0,0,1,0,0,0,0,0,1,4
507,29.807687,0,0,26.5500,True,True,1,0,0,0,...,1,0,0,0,0,0,0,0,1,2

In [117]:
#4. 파생변수
X_train['age_qcut'] = pd.qcut(X_train['age'], 5, labels=False)
X_test['age_qcut'] = pd.qcut(X_test['age'], 5, labels=False)

X_train

,age,sibsp,parch,fare,adult_male,alone,pclass_1,pclass_2,pclass_3,sex_female,...,deck_C,deck_D,deck_E,deck_F,deck_G,embark_town_Cherbourg,embark_town_Queenstown,embark_town_S,embark_town_Southampton,age_qcut
692,29.807687,0,0,56.4958,True,True,0,0,1,0,...,1,0,0,0,0,0,0,0,1,2
481,29.807687,0,0,0.0000,True,True,0,1,0,0,...,1,0,0,0,0,0,0,0,1,2
527,29.807687,0,0,221.7792,True,True,1,0,0,0,...,1,0,0,0,0,0,0,0,1,2
855,18.000000,0,1,9.3500,False,False,0,0,1,1,...,1,0,0,0,0,0,0,0,1,0
801,31.000000,1,1,26.2500,False,False,0,1,0,1,...,1,0,0,0,0,0,0,0,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
359,29.807687,0,0,7.8792,False,True,0,0,1,1,...,1,0,0,0,0,0,1,0,0,2
258,35.000000,0,0,512.3292,False,True,1,0,0,1,...,1,0,0,0,0,1,0,0,0,3
736,48.000000,1,3,34.3750,False,False,0,0,1,1,...,1,0,0,0,0,0,0,0,1,4
462,47.000000,0,0,38.5000,True,True,1,0,0,0,...,0,0,1,0,0,0,0,0,1,4
507,29.807687,0,0,26.5500,True,True,1,0,0,0,...,1,0,0,0,0,0,0,0,1,2

In [ ]:
#5. 스케일
from sklearn.preprocessing import MinMaxScaler
scaler = ['age', 'fare']
min = MinMaxScaler()
min.fit(X_train[scaler])

X_train[scaler] = min.transform(X_train[scaler])
X_test[scaler] = min.transform(X_test[scaler])
print(X_train.head())

In [118]:
#6. 데이터 분리
X_train, X_valid, y_train, y_valid = train_test_split(X_train, y_train, test_size=0.2, random_state=42, stratify=y_train)

print('X_train', X_train.shape)
print('X_valid', X_valid.shape)
y_train

X_train (569, 32)
X_valid (143, 32)

242    0
450    0
721    0
733    0
191    0
      ..
451    0
289    1
819    0
812    0
219    0
Name: survived, Length: 569, dtype: int64